{
	"musician": "band",
	"paragraphs": [
		"Committed to honoring the past and expanding the future of percussion music, Mantra Percussion brings to life new works for percussion by living composers, collaborates with artists from diverse genres and styles, and questions what it means to communicate music with percussion instruments. Mantra Percussion engages new audiences by challenging the standard concert format through evening-length events that look toward a grander artistic vision.",
		"Since forming as an ensemble in 2009, Mantra Percussion has been featured throughout NorthAmerica, Europe and Asia, including BAM's Next Wave Festival,the Bang on a Can Marathon, Duke Performances, the Redcat Theater in Los Angeles, National Public Radio, the Indianapolis Museum of Art, Philadelphia Fringe Festival, the Drogheda Festivalin Ireland, the Ecstatic Music Festival and the Ecstatic Summer Festival, Mass MoCA, the Right Now Festival in South Korea, Vancouver New Music, Make Music New York, the Bang on a Can Summer Institute, Fast Forward Austin, Apple Store at Lincoln Center, the Carlsbad Music Festival, the Bowling Green New Music Festival, MIT with Bang on a Can All-Stars, Percussive Arts Society International Convention, X Avant Festival, New Music New College, Moving Sounds Festival, Ear Heart Music, Hi Fi Music Festival, Wesleyan University, the University of Michigan, SMU Meadows School of Music, University of New Orleans, Northern Illinois University, Louisiana Tech, Southeastern Louisiana University, CalArts, Chapman University, SUNY Buffalo, Manhattan School of Music and others.",
		"After co-commissioning Michael Gordon'sevening-length percussion sextet Timber, they gave the work'sUnited States premiere in October 2011 and subsequently touredthe work internationally. Mantra Percussion also gave the New York premiere of Timber at the Brooklyn Academy of Music's Next Wave Festival in December 2012.",
		"Over the past eight years Mantra Percussion has commissioned and/or premiered over 40 new works for percussion ensemble.",
		"Mantra Percussion has been hailed by The New York Times as \"finely polished...a fresh source of energy\" and by TimeOut New York as \"forward thinking\"; the group was praised by The New Yorker and TimeOut New Yorkfor presenting one of the ten best classical performances of 2012. They recorded one of Time Out New York's Ten Best Classical Albums of 2011 -- Aaron Siegel's Science Is Only A Sometimes Friend on Lockstep Records, Michael Fiday's Hands On! on Innova Records, and in 2016 they released a double-CD album, Timber Remixed/Timber Live, on Cantaloupe Music with 12 remixes of Michael Gordon's Timber by some of the leading electronica artists today including Squarepusher, Jóhann Jóhannsson, Tim Hecker, Fennesz, Oneohtrix Point Never, Hauschka and more."
	]
}
