{
	"musician": "chris",
	"paragraphs": [
		"Chris Graham is an international new music musician living and working in New York City.  Chris has consistently worked and performed with notable groups such as Newband, Ear to Mind, Talujon Percussion, Mantra Percussion, and is a founding member and director of Iktus Percussion; as well as co-principal percussionist for Ensemble Moto Perpetuo. He has commissioned and premiered works by established composers such as Charles Wuorinen, Martin Bresnick, Michael Gordon, Philippe Manoury, Franco Donatoni, Philippe Hurel, Mauricio Kagel, Ron Ford, Michel Vander Aa, Hugo Morales,Gerard Grisey, Harry Partch, John Luther Adams, Lisa R. Coons,Daniel Wohl, Jenny Olivia Johnson,  Angelica Negron, SebastianArmoza, Mathew Welch, Philip Schuessler, Levy Lorenzo, Matt Hough, Joe DiPonio, Brian Jacobs, Aaron Siegel, Ted Herne, Tristan Perich, Inhyun Kim, Jen Wang, Joseph Waters, Stephan Weisman,and Billy Martin (of Medeski, Martin, and Wood), among others.",
		"In addition to his preforming credits, Chris organizes and curates concerts in NYC working closely with young up-and-coming new music ensembles such as, Mivos String Quartet, Loadbang Ensemble, Yarn Wire, Either/Or Ensemble, thingNY, Varispeed, Panapoly Performance Lab, Ensemble Pamplemousse, Elevator Rose, Cadillac Moon Ensemble, Duo Orfeo, and Concert Black. He has co-organized several performances for Issue Project Room's \"Gaudeamus Muzieweek New York\" and \"Darmstadt Series\" receiving critical acclaim in 2010 from TimeOut New York as one of the top ten concerts of the year performing Karlheinz Stockhausen'sepic works, Mikrophonie and Kontakte.",
		"As an artist-in-residence he has taught at Suny Purchase and Cuny Brooklyn College, working with both student percussion ensembles and student composers.  He is the director of the Stony Brook pre-college percussion ensemble and is on faculty at Suffolk Community College. He received a Bachelors of Music and Performers Certificate fromSUNY Purchase College, Masters of Music from Stony Brook University, where he is currently a candidate in the Doctoral of theMusical Arts program.  Previous teachers include Raymond DesRoches, Dominic Donato, Tom Kolor, Joseph Pereira, and Eduardo Leandro."
	]
}
