[
	{
		"musician": "band",
		"paragraphs": [
			"Committed to honoring the past and expanding the future of percussion music, Mantra Percussion brings to life new works for percussion by living composers, collaborates with artists from diverse genres and styles, and questions what it means to communicate music with percussion instruments. Mantra Percussion engages new audiences by challenging the standard concert format through evening-length events that look toward a grander artistic vision.",
			"Since forming as an ensemble in 2009, Mantra Percussion has been featured throughout NorthAmerica, Europe and Asia, including BAM's Next Wave Festival,the Bang on a Can Marathon, Duke Performances, the Redcat Theater in Los Angeles, National Public Radio, the Indianapolis Museum of Art, Philadelphia Fringe Festival, the Drogheda Festivalin Ireland, the Ecstatic Music Festival and the Ecstatic Summer Festival, Mass MoCA, the Right Now Festival in South Korea, Vancouver New Music, Make Music New York, the Bang on a Can Summer Institute, Fast Forward Austin, Apple Store at Lincoln Center, the Carlsbad Music Festival, the Bowling Green New Music Festival, MIT with Bang on a Can All-Stars, Percussive Arts Society International Convention, X Avant Festival, New Music New College, Moving Sounds Festival, Ear Heart Music, Hi Fi Music Festival, Wesleyan University, the University of Michigan, SMU Meadows School of Music, University of New Orleans, Northern Illinois University, Louisiana Tech, Southeastern Louisiana University, CalArts, Chapman University, SUNY Buffalo, Manhattan School of Music and others.",
			"After co-commissioning Michael Gordon'sevening-length percussion sextet Timber, they gave the work'sUnited States premiere in October 2011 and subsequently touredthe work internationally. Mantra Percussion also gave the New York premiere of Timber at the Brooklyn Academy of Music's Next Wave Festival in December 2012.",
			"Over the past eight years Mantra Percussion has commissioned and/or premiered over 40 new works for percussion ensemble.",
			"Mantra Percussion has been hailed by The New York Times as \"finely polished...a fresh source of energy\" and by TimeOut New York as \"forward thinking\"; the group was praised by The New Yorker and TimeOut New Yorkfor presenting one of the ten best classical performances of 2012. They recorded one of Time Out New York's Ten Best Classical Albums of 2011 -- Aaron Siegel's Science Is Only A Sometimes Friend on Lockstep Records, Michael Fiday's Hands On! on Innova Records, and in 2016 they released a double-CD album, Timber Remixed/Timber Live, on Cantaloupe Music with 12 remixes of Michael Gordon's Timber by some of the leading electronica artists today including Squarepusher, Jóhann Jóhannsson, Tim Hecker, Fennesz, Oneohtrix Point Never, Hauschka and more."
		]
	},
	{
		"musician": "al",
		"paragraphs": [
			"Al Cerulo, a founding member of Mantra Percussion, has been praised for his work as a musician and educator, both nationally and internationally. Al is an advocate for the commissioning and performing of new works by up-and-coming composers to help move forward and breath new life into the art this is music.",
			"Along with his own ensembles, he has been privileged to perform with groups such as the New Jersey Percussion Ensemble, Sospeso Ensemble, Either/Or, and the Philadelphia VirtuosoSociety to name a few.  He has worked along side great composers such as Pierre Boulez, George Crumb, Mario Davidowsky, Michael Gordon, and Steve Reich, just to name a few.  As a recordingartist, he can be heard on a variety of recording labels such as Nexus, UTF, Innova Records, Lock Step Records and Bridgewater.",
			"Al holds a masters degree from the Manhattan School of Music and degree in music education from William Paterson University.  He has studied under the great tutelage of Raymond DesRoches, Peter Jarvis, Tom Kolor, Chris Lamb, Duncan Patton, Jim Preiss and Steven Schick."
		]
	},
	{
		"musician": "chris",
		"paragraphs": [
			"Chris Graham is an international new music musician living and working in New York City.  Chris has consistently worked and performed with notable groups such as Newband, Ear to Mind, Talujon Percussion, Mantra Percussion, and is a founding member and director of Iktus Percussion; as well as co-principal percussionist for Ensemble Moto Perpetuo. He has commissioned and premiered works by established composers such as Charles Wuorinen, Martin Bresnick, Michael Gordon, Philippe Manoury, Franco Donatoni, Philippe Hurel, Mauricio Kagel, Ron Ford, Michel Vander Aa, Hugo Morales,Gerard Grisey, Harry Partch, John Luther Adams, Lisa R. Coons,Daniel Wohl, Jenny Olivia Johnson,  Angelica Negron, SebastianArmoza, Mathew Welch, Philip Schuessler, Levy Lorenzo, Matt Hough, Joe DiPonio, Brian Jacobs, Aaron Siegel, Ted Herne, Tristan Perich, Inhyun Kim, Jen Wang, Joseph Waters, Stephan Weisman,and Billy Martin (of Medeski, Martin, and Wood), among others.",
			"In addition to his preforming credits, Chris organizes and curates concerts in NYC working closely with young up-and-coming new music ensembles such as, Mivos String Quartet, Loadbang Ensemble, Yarn Wire, Either/Or Ensemble, thingNY, Varispeed, Panapoly Performance Lab, Ensemble Pamplemousse, Elevator Rose, Cadillac Moon Ensemble, Duo Orfeo, and Concert Black. He has co-organized several performances for Issue Project Room's \"Gaudeamus Muzieweek New York\" and \"Darmstadt Series\" receiving critical acclaim in 2010 from TimeOut New York as one of the top ten concerts of the year performing Karlheinz Stockhausen'sepic works, Mikrophonie and Kontakte.",
			"As an artist-in-residence he has taught at Suny Purchase and Cuny Brooklyn College, working with both student percussion ensembles and student composers.  He is the director of the Stony Brook pre-college percussion ensemble and is on faculty at Suffolk Community College. He received a Bachelors of Music and Performers Certificate fromSUNY Purchase College, Masters of Music from Stony Brook University, where he is currently a candidate in the Doctoral of theMusical Arts program.  Previous teachers include Raymond DesRoches, Dominic Donato, Tom Kolor, Joseph Pereira, and Eduardo Leandro."
		]
	},
	{
		"musician": "joe",
		"paragraphs": [
			"Joe Bergen is a percussionist and educator active in the New York metro area. As a co-founderof Mantra Percussion and Transit New Music, Joe has toured North America performing some of the most interesting and compelling music of our time. Joe also frequently performs with the Cellar and Point, Experiments in Opera, and from 2007-2014 with Newband performing on Harry Partch's original microtonal instruments.  Joe has recorded extensively for tv, radio, film, and video game soundtracks most notably playing percussion for the 2011 RockStar video game of the year; Read Dead Redemption.  He can be heard on over a dozen labels including New Amsterdam, Cantaloupe, Cunieform, and New World Records.",
			"A native of RamseyNJ, Joe studied with John Ferrari and Tom Kolor at William Paterson University with additional studies from Gordon Gottlieb and Nancy Zeltsman. In addition to performing with Mantra, Joe is the group's education director overseeing programs including; Mantra Youth Percussion, the Necessary Noise Festival, and Mantra's In-School Residencies.  Additionally, Joe is a Wolf Trap early education teaching artist and dance accompanist for NewJersey Performing Arts Center, the percussion director and in school specialist for Rahway High School, and is an accomplished arranger in the education world writing music for various award winning groups."
		]
	},
	{
		"musician": "mark",
		"paragraphs": [
			"Mark Utley is a percussionist/drummer based in Brooklyn, NY. He is attracted to music that defies expectations, especially music that is both alienating and engaging at once.",
			"Along with his work with Mantra Percussion, Mark is also the drummer for the minimalist/maximalist rock quartet Marateck, a group that \"channels more than any reasonable listener can handle, but in the most efficient way possible\" (Tone Madison)."
		]
	},
	{
		"musician": "mike",
		"paragraphs": [
			"Michael McCurdy is a drummer and contemporary classical percussionist based in New York City and is a co-founder and artistic director of Mantra Percussion.",
			"As a classical performer, Michael focuses on commissioning, premiering and recording music written by living composers. Many of his collaborations blend music with dance, with text and theatre, and with electronics or interactive computer.",
			"In addition to his work as a classical percussionist, a clinician and a soloist, Michael performs and records as drummer with critically acclaimed progressive rock bands. Recent projects have included the Knells, Hi Red Center and, most recently, hoferlanz with Ben Lanz (The National/Beirut) and Aaron Arntz(Grizzly Bear).",
			"Michael has released recordings on New Amsterdam Records, Cantaloupe Music, Joyful Noise Recordings, AlbanyRecords, Innova, and Lockstep Records.​"
		]
	}
]
